Hi @falzm, thanks for the hint, but unfortunately the suggested change results in the same error:

```
$ terraform apply -var ssh_key=simon.gerber@vshn2021 -var domain=c-exo-ocp4-test.appuio-beta.ch -var node_state=Running
exoscale_domain.dom: Refreshing state... [id=c-exo-ocp4-test.appuio-beta.ch]
exoscale_compute.vm: Refreshing state... [id=fa731b60-9cc4-4349-8c84-d17a245c0cbb]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # exoscale_compute.vm will be updated in-place
  ~ resource "exoscale_compute" "vm" {
        id                 = "fa731b60-9cc4-4349-8c84-d17a245c0cbb"
        name               = "test-vm"
      ~ state              = "Stopped" -> "Running"
        tags               = {}
        # (16 unchanged attributes hidden)
    }

  # exoscale_domain_record.vm[0] will be created
  + resource "exoscale_domain_record" "vm" {
      + domain      = "c-exo-ocp4-test.appuio-beta.ch"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + name        = "test-vm"
      + prio        = (known after apply)
      + record_type = "A"
      + ttl         = 60
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_compute.vm: Modifying... [id=fa731b60-9cc4-4349-8c84-d17a245c0cbb]
exoscale_compute.vm: Still modifying... [id=fa731b60-9cc4-4349-8c84-d17a245c0cbb, 10s elapsed]
exoscale_compute.vm: Modifications complete after 18s [id=fa731b60-9cc4-4349-8c84-d17a245c0cbb]

Error: Provider produced inconsistent final plan

When expanding the plan for exoscale_domain_record.vm[0] to include new values
learned so far during apply, provider
"registry.terraform.io/exoscale/exoscale" produced an invalid new value for
.content: was cty.StringVal(""), but now cty.StringVal("159.100.251.157").

This is a bug in the provider, which should be reported in the provider's own
issue tracker.

```